{"chars":{"rp":{"vn_s":{"name":"Vincent Northwood","id":"vn_s","species":"Demon -> Devil","height":"5'10\"","weight":"115lbs","description":"Vincent is a very pale, slender demon with cherry red eyes (that can even glow) and fangs. His hair is white and fluffy, and he has two, solid white horns that are ever so slightly wavy and extend about 2 inches from the top of his head. He has a very long (about 4 to 5ft) thin black tail with a lethally sharp black spade at the end. Though, the full length of the tail is not often seen. He also has feathery black wings, *massive* in size, that are flight-capable and can be hidden inside his body at will. His appearance actually looks rather kind at first glance, despite his awful personality.","gender":"Male","age":"130 years","nicknames":"Bounty Hunter, Dragon-Slayer, Dai, The Devil, Satan, The Demon King, King Northwood, The Golden Warrior, Blademaster","personality":"Vincent is a blunt, hard-headed, stubborn asshole who really enjoys making other people upset, and overall enjoys not being around them in general. He has a really bad bloodlust that he fights to keep under control every single day, and often finds himself enjoying his kills, which he gets from Bounty-Hunting. Vincent loves to sit by his fireplace and drink vodka, though life often has other desires for him. Does not do well with others, and is not a kind person","skills":"Vincent is a very skilled fighter, mercenary, knife-maker and user, and being an asshole","hobbies":"Vincent enjoys Bounty Hunting and sitting at his fireplace. Overall, he doesn't enjoy life, so he doesn't have a lot of hobbies","flaws":"Vincent pushes others away and doesn't know when to quit. He longs for a purpose, but doesn't see that he has so much purpose when it's spelled out in bold letters in front of him","virtues":"He is, at his deep core, a caring and trustworthy person. If he pledges his loyalty to someone or to some cause, or makes a deal or promise, it **is not broken**. Deep down inside, he cares about his few friends, though he doesn't show it, and he stops at nothing to ensure their safety above his own.","apparel":"Wearing a long, hooded, tattered, billowing black cloak, Vincent bears a mysterious look, coupled with his black boots and wrinkled black pants (can you tell he loves black?). He walks around with knives, money, vodka flasks (yes, plural), and two photos in his inner pockets, as well as a sentient and ancient blue ball known as Sath, whom he is bonded with, and creates a sword for him to fight with upon command.","is_oc":true,"ref_image":"https://cdn.discordapp.com/attachments/738579474249023489/738602045061201971/received_237733120647684.jpeg","ref_link":"https://aminoapps.com/p/w2pasi","powers":"An affinity for dark, flame, and spatial magic, with capabilities to use all kinds of magic. He also has Sath, who grants him the form of the Golden Warrior during Transference, giving him a golden appearance and immense power.","elemental":"Dark, flame, affinity -> Able to use all elementals","birth_info":"Earth -> Year Unknown","other_notes":"Has a fondness for sharp things and fire. Please hide your kitchen knives."},"valk":{"name":"Valkyrie","id":"valk","species":"Crystal High-Dragon","height":"6'2\"","weight":"Omitted","description":"Valkyrie has blue scales all over her thin figure, as well as a thick, long, lizard-like tail. Her scales travel up her neck, before ending at about her chin-line. She has Silvery-Blue hair that alternates in color through its long, thick and wavy shape. Her eyes are a fierce emerald green, and compliment her bold and shining facial shape. Beneath her scales and in the gaps between them, you can see a glowing white-blue that seems to move beneath the scales like magma. Her scales look crystaline, completing her name as the Crystal Dragon","gender":"Female","age":"Omitted","nicknames":"Valk, The Crystal Dragon","personality":"Valkyrie is sometimes quiet, kind, and reserved. Other times, she is strong and fierce - mainly on the battlefield. She loves to haze the dungeon newbies, but also makes sure that they know that they are well-protected at her side. At home, which is a place she rarely goes, she loves snuggling up with her silver wolf, Luno, and drinking lemon tea in front of the fireplace while reading.","skills":"Valkyrie is undisputedly one of the best fighters, especially when it comes to the dungeon. She is a wonderful tactician and strategist, and prides herself on her protective ability. She is not to be underestimated. Also has a great sense of humor","hobbies":"Valkyrie loves tea-drinking, fighting, and being in the dungeon to fend off the endless threats to all of humanity","flaws":"Valkyrie is stubborn and overconfident. She isn't quite contemptuous, but more overextends herself and believes that she can do things that simply nobody can do - and does so out of the sheer kindness of her heart","virtues":"Valkyrie is caring of others, though she hides it through her teasing and humor, and will sacrifice anything of hers to protect anyone and anything","apparel":"On the battlefield, she wears a thick, fur cloak atop a set of enchanted armor. She bears a pendant with a moon on it, which has a tiny purple gem at its center. She often has something in the right side of her hair to keep it back. Her appearance often gives off the idea of a fierce, lone-wolf warrior in the middle of winter.","is_oc":true,"ref_image":"https://cdn.discordapp.com/avatars/619305062900039726/11f87bc65ad38fbcee6f95202f835360.webp?size=2048","ref_link":"Omitted","powers":"Valkyrie has an affinity for protection-type magic, such as shielding, trapping, and healing. As well as a mysterious range of abilities that come with her being a High Dragon, and the Crystal one at that.","elemental":"Protection, Dragon -> Crystal-type","birth_info":"At the beginning of time itself... or so it is believed","other_notes":"This is the humanoid version of Valkyrie!"}},"dnd":{}}}