{
    "chars":{
        "rp":{
            "vn_s":{
                "name":"Vincent Northwood",
                "id":"vn_s",
                "species":"Demon -> Devil",
                "height":"5'10\"",
                "weight":"115lbs",
                "description":"Vincent is a very pale, slender demon with cherry red eyes (that can even glow) and fangs. His hair is white and fluffy, and he has two, solid white horns that are ever so slightly wavy and extend about 2 inches from the top of his head. He has a very long (about 4 to 5ft) thin black tail with a lethally sharp black spade at the end. Though, the full length of the tail is not often seen. He also has feathery black wings, *massive* in size, that are flight-capable and can be hidden inside his body at will. His appearance actually looks rather kind at first glance, despite his awful personality.",
                "gender":"Male",
                "age":"130 years",
                "nicknames":"Bounty Hunter, Dragon-Slayer, Dai, The Devil, Satan, The Demon King, King Northwood, The Golden Warrior, Blademaster",
                "personality":"Vincent is a blunt, hard-headed, stubborn asshole who really enjoys making other people upset, and overall enjoys not being around them in general. He has a really bad bloodlust that he fights to keep under control every single day, and often finds himself enjoying his kills, which he gets from Bounty-Hunting. Vincent loves to sit by his fireplace and drink vodka, though life often has other desires for him. Does not do well with others, and is not a kind person",
                "skills":"Vincent is a very skilled fighter, mercenary, knife-maker and user, and being an asshole",
                "hobbies":"Vincent enjoys Bounty Hunting and sitting at his fireplace. Overall, he doesn't enjoy life, so he doesn't have a lot of hobbies",
                "flaws":"Vincent pushes others away and doesn't know when to quit. He longs for a purpose, but doesn't see that he has so much purpose when it's spelled out in bold letters in front of him",
                "virtues":"He is, at his deep core, a caring and trustworthy person. If he pledges his loyalty to someone or to some cause, or makes a deal or promise, it **is not broken**. Deep down inside, he cares about his few friends, though he doesn't show it, and he stops at nothing to ensure their safety above his own.",
                "apparel":"Wearing a long, hooded, tattered, billowing black cloak, Vincent bears a mysterious look, coupled with his black boots and wrinkled black pants (can you tell he loves black?). He walks around with knives, money, vodka flasks (yes, plural), and two photos in his inner pockets, as well as a sentient and ancient blue ball known as Sath, whom he is bonded with, and creates a sword for him to fight with upon command.",
                "is_oc":true,
                "ref_image":"https://cdn.discordapp.com/attachments/738579474249023489/738602045061201971/received_237733120647684.jpeg",
                "ref_link":"https://aminoapps.com/p/w2pasi",
                "powers":"An affinity for dark, flame, and spatial magic, with capabilities to use all kinds of magic. He also has Sath, who grants him the form of the Golden Warrior during Transference, giving him a golden appearance and immense power.",
                "elemental":"Dark, flame, affinity -> Able to use all elementals",
                "birth_info":"Earth -> Year Unknown",
                "other_notes":"Has a fondness for sharp things and fire. Please hide your kitchen knives."
            }
        },
        "dnd":{}
    }
}