{"chars":{"rp":{"muff1":{"name":"Lazurus","id":"muff1","species":"Human","height":"6'1\"","weight":"183lbs","description":"Lazurus is a tall but slim guy, he has a frostbite scar over his right eye and white almost silver hair in a messy ponytail and scraggaly facial hair. he has bandages over his arms and chest, he has a small locket necklace that is always cold to the touch, and he has a small white-ish kestrel hawk that is always close by.","gender":"Male","age":"23","nicknames":"Laz, bird-boy, jack, jack-frost, etc.","personality":"Lazurus is cold and calculated, he has his warm moments but thats usualy with close friends or family. he can, at times, shut down and ignore everyone. he often notices things others dont and has a good eye for things.","skills":"Lazurus can see fairly far, good at parkour, running, and hiding. Lazurus has a surprising amount of medical experience, although its mostly surface experience. he has a bit of hand to hand combat as well.","hobbies":"He often runs around and hides, paintball, martial arts, bird watching, birds in general, and he likes to spar with others.","flaws":"He likes birds a little too much, he can get too focused on getting the task done, he gets extremely parent like when people get hurt, no matter how minor the injury is.","virtues":"he cares for others, can get a task done, he likes birds, and he helps when he can.","apparel":"he wheres a variety of clothing but will always wear bandages around his hands and chest and a locket around his neck. he keeps his long white hair in a ponytail, but he rarely tries to keep his hair under control. he like sweatpants and will wear those most often. he keeps his frostbite scar over his right eye uncovered.","is_oc":true,"ref_image":"Omitted","ref_link":"Omitted","powers":"**ELDRITCH BLAST** from really far away, he can freeze and control water, can summon his hawk familiar, can create objects from ice (its still ice though), and he can lower the ambient temperature around him","elemental":"Frost, cold, summoning, binding.","birth_info":"He was born in Canada. (time depends on time period)","other_notes":"He has a hole in each of his hands and his chest. when using magic his bandages light up with eldritch runes. (additional powers, i messed up earlier) he can bind elemental's into a object using his bandages, can create floating, spectral hands, and can create unstable ice."}},"dnd":{}}}