{"chars":{"rp":{"kinks_bitch":{"name":"Kara","id":"kinks_bitch","species":"Human/Illusionist","height":"170cm","weight":"55kg","description":"Though she can alter her appearance whenever, she is most commonly seen as a young human female. Kara has a slim, toned physique and is deceptively strong. She is most commonly seen with natural green hair, styled in a long pixie cut with a nape undercut. She wears black snake-bite hoops and an eyebrow piercing on her left eyebrow. She has dark green and gold eyes, with shapely eyebrows, a dainty nose (which she is anything but lol) and she has a dimple in her left cheek when she smiles. Her canines are slightly more accentuated than normal.","gender":"Female","age":"19 in Earthly years","nicknames":"Kinks, Kink, Kar, Kars","personality":"Kara is an outgoing and friendly soul, though she has a very wide dark, sadistic streak in her. Her strengths are her magic, making new friends, the ability to make any situation either confusing af or hilarious. She has an impulsive streak, and will often say the first thing that jumps into her head. She has no filter and can chug down a bottle of liquor better than most humans and others alike. Her weaknesses include her affinity for getting herself into trouble (though she can't help but enjoy it when she does), her peppermint leaf lolly addiction, playing (mostly) harmless pranks on others and her partner (seriously don't ever go after him or her peppermints or you'll end up in a very.... uncomfortable situation).","skills":"Fighting, Knives, All things with a blade, Blowing bubblegum bubbles, Petting all da good doggo bois and Mastering new magic (although she hasn't needed to actively learn new magic in years).","hobbies":"Baking, Reading, Cloud-laying with her partner watching the sunrise/sunset, snowball fights, lounging around with her Python","flaws":"Can be sadistic, cold and mean. When she gets in a mood, watch out, if you don't want to be hurt, don't purposefully antagonise her. She may be swayed with a peppermint leaf.","virtues":"She's courageous, bold, deadly. She would do anything for her friends and family.","apparel":"She wears black skinny jeans, with pockets that can hold literally anything (the perks of magic, lucky bish). She wears a black shirt (longsleeve if she doesn't wear the jacket) with a green jacket, with golden sigils on the hem and dark green runes interwoven into the fabric of the jacket. She either wears black combat boots or goes barefoot. Her nails are painted black and gold most of the time. She wears no holsters or weapon bands of any kind due to her ability to magic things out of thin air.","is_oc":true,"ref_image":"Omitted","ref_link":"Omitted","powers":"Yes, though mostly unknown. What is known though, is that she is an illusionist and can conjure up a wide range of things. She isn't all powerful, just extremely knowledgable. She can float and manipulate objects and people and the rest is up to you to find out.","elemental":"Unknown","birth_info":"She was born on Earth and around 250 years ago","other_notes":"She is most certainly not a caffeine addict."},"karahoe":{"name":"Kara","id":"karahoe","species":"Human or Illusionist","height":"170cm","weight":"55kg","description":"Though she can alter her appearance whenever, she is most commonly seen as a young human female. Kara has a slim, toned physique and is deceptively strong. She is most commonly seen with natural green hair, styled in a long pixie cut with a nape undercut. She wears black snake-bite hoops and an eyebrow piercing on her left eyebrow. She has dark green and gold eyes.","gender":"Female","age":"19 in earth years","nicknames":"Kara, Kar, Kinks, Kink","personality":"Kara is an outgoing and friendly soul, though she has a very wide dark, sadistic streak in her. Her strengths are her magic, making new friends, the ability to make any situation either confusing af or hilarious. She has an impulsive streak, and will often say the first thing that jumps into her head. She has no filter and can chug down a bottle of liquor better than most humans and others alike. Her weaknesses include her affinity for getting herself into trouble (though she can't help but enjoy it when she does), her peppermint leaf lolly addiction, playing (mostly) harmless pranks on others and her partner (seriously don't ever go after him or her peppermints or you'll end up in a very.... uncomfortable situation).","skills":"She's courageous, bold, deadly. She would do anything for her friends and family.","hobbies":"Baking, Reading, Cloud-laying with her partner watching the sunrise/sunset, snowball fights, lounging around with her Python","flaws":"Can be sadistic, cold and mean. When she gets in a mood, watch out, if you don't want to be hurt, don't purposefully antagonise her. She may be swayed with a peppermint leaf.","virtues":"She's courageous, bold, deadly. She would do anything for her friends and family.","apparel":"She wears black skinny jeans, with pockets that can hold literally anything (the perks of magic, lucky bish). She wears a black shirt (longsleeve if she doesn't wear the jacket) with a green jacket, with golden sigils on the hem and dark green runes interwoven into the fabric of the jacket. She either wears black combat boots or goes barefoot. Her nails are painted black and gold most of the time. She wears no holsters or weapon bands of any kind due to her ability to magic things out of thin air.","is_oc":true,"ref_image":"Omitted","ref_link":"Omitted","powers":"Yes, though her powers are mostly unknown.","elemental":"Unknown","birth_info":"Earth, 1800's","other_notes":"She is most certainly not a caffeine addict."}},"dnd":{}}}